{
    "home": "Home",
    "about": "About me",
    "project": "Projects",
    "resume": "Resume",
    "im": "I'm",
    "description": "With more than 3 years of experience, I build interactive web applications using a variety of languages and frameworks such as React, Next.js and Express.js.",
    "contact me": "Contact me",
    "experience": "Experience",
    "proyects": {
        "title": {
            "first": "My Recent",
            "second": "Works"
        },
        "description": "Here are a few projects I've worked on recently.",
        "surasalud": {
            "title": "Health insurance",
            "description": "Optimized high-converting landing pages for a Google Ads campaign, aimed at selling Sura brand insurance."
        },
        "suraautos": {
            "title": "Car insurance",
            "description": "Optimized high-converting landing pages for a Google Ads campaign, aimed at selling Sura brand insurance."
        },
        "artofgalaxy": {
            "title": "Art of galaxy",
            "description": "React aplication with modern design. For marketing company."
        },
        "inglesenminutos": {
            "title": "Ingles en minutos",
            "description": "Educational platform for learning English, integrating AI models from Google and AssemblyAI for speech recognition."
        },
        "integragym": {
            "title": "Integra gym",
            "description": "Internal management system for a gym. My focus was on implementing payment, membership, and plan modules, as well as member registration and control."
        },
        "latrikmedical": {
            "title": "Latrik medical",
            "description": "Internal management system for a clinic. The front-end developed in react."
        }
    },
    "works": {
        "duties": "My duties",
        "landing": {
            "title": "Landing Page Development for Digital Marketing Campaign",
            "description": "Created and optimized high-converting landing pages for a Google Ads campaign, aimed at selling Sura brand insurance.",
            "start": "april 2025",
            "end": "june 2025",
            "duties": [
                "User interface design",
                "Conversion optimization",
                "Front-end and back-end development using React and Next.js",
                "Integration of Google Ads and Google Analytics"
            ]
        },
        "xtetic": {
            "title": "Medical License Verification System Development",
            "description": "Development of an automated system for validating medical professional licenses for the company Xtetic. The project utilized web scraping to streamline and verify information from multiple sources, optimizing a critical process.",
            "start": "december 2024",
            "end": "february 2025",
            "duties": [
                "I was responsible for the analysis and design of a web scraper for medical license validation, defining the logic and architecture for the data extraction process.",
                "I developed a program in Node.js to implement the scraper and create a separate API.",
                "I handled the integration with the JotForm and Pipedrive APIs, consuming data to enrich information and automate the workflow.",
                "I was in charge of the complete project deployment on AWS, configuring the environment to ensure the service's availability and correct operation."
            ]
        },
        "inglesenminutos": {
            "title": "Development of an AI-Powered Educational Web Application",
            "description": "Participated in the creation of an educational platform for learning English, integrating AI models from Google and AssemblyAI for speech recognition.",
            "start": "january 2024",
            "end": "september 2024",
            "duties": [
                "Integration with assemblyAI and speech.",
                "Interface and logic for audio recording.",
                "Logic for incorrect word recognition.",
                "Payment and membership system.",
                "User registration system."
            ]
        },
        "integragym": {
            "title": "Internal Management System Development for a Gym",
            "description": "Development of an internal management system for a gym. My focus was on implementing payment, membership, and plan modules, as well as member registration and control.",
            "start": "january 2023",
            "end": "november 2023",
            "duties": [
                "I implemented and configured a secure payment system for the gym, managing transaction processing and the financial history of all members.",
                "I developed a complete interface for membership management, allowing for the creation, editing, and tracking of each user's status.",
                "I created the user interface and logic for member check-ins and check-outs, controlling access and tracking attendance at the gym."
            ]
        },
        "artofgalaxy": {
            "title": "Web Application Implementation with Modern Design",
            "description": "Participated in the creation of a web application focused on an engaging user experience (UX) and a modern design. Multiple animations and effects were implemented for a visually appealing and dynamic user interface (UI).",
            "start": "february 2025",
            "end": "march 2025",
            "duties": [
                "Implementation of animations and effects",
                "Implementation of a well-designed grid layout",
                "Implementation of interactive slideshows",
                "Correction of design errors"
            ]
        }
        
    },
    "skills": 
    {
        "title": "Professional <1>Skillset</1>",
        "description": {
            "p1" : "I'm a versatile software developer with extensive experience across multiple <1>frameworks</1> and languages, primarily within the <3>JavaScript ecosystem</3>. My work spans both the <5>frontend and backend</5>. On the client side, I've built dynamic and responsive user interfaces using frameworks like <7>React</7> and <9>Angular</9>. For the server side, I've leveraged <11>Next.js</11> and <13>Express.js</13> to develop robust and scalable applications.",
            "p2" : "Beyond my JavaScript proficiency, I have experience with <1>PHP</1>, where I've focused on creating custom <3>WordPress themes and plugins</3>. My skill set also includes mobile development, having built cross-platform applications with <5>React Native</5> and <7>Flutter</7>. I complement these abilities with expertise in <9>web scraping</9> using tools like <11>Playwright</11>, efficiently extracting data for various projects."
        },
        "tools": "<0>Tools</0> I use"
    },
    "contact": {
        "title": "FIND ME ON",
        "description": "Feel free to <1>connect</1> with me",
        "form":{
            "title": "LET'S TALK",
            "description": "Have a question? Need a custom quote? Want to schedule a consultation? Use the form below or connect with me directly and I respond quickly.",
            "name": "Name",
            "email": "Email",
            "message": "Message",
            "submit": "Submit"
        },
        "success": "Thank you for your message. We will get back to you soon."
    },
    "footer": {
        "develop": "Designed and Developed by"
    }
}