{
    "home": "Inicio",
    "about": "Sobre mi",
    "project": "Proyectos",
    "resume": "Curriculum",
    "im": "Soy",
    "description": "Con más de 3 años de experiencia, construyo aplicaciones web interactivas utilizando una variedad de lenguajes y frameworks como React, Next.js y Express.js.",
    "contact me": "Contáctame",
    "experience": "Experiencia",
    "works": {
        "duties": "Mis cargos",
        "landing": {
            "title": "Desarrollo de Landing Pages para Campaña de Marketing Digital",
            "description": "Creación y optimización de landing pages de alta conversión para una campaña en Google Ads, dirigida a la venta de seguros de la marca Sura.",
            "start": "abril del 2025",
            "end": "junio del 2025",
            "duties": [
                "Diseño de interfaces de usuario",
                "Optimización de conversión",
                "Desarrollo del front-end y back-end usando React y Next.js",
                "Integración de Google Ads y Google Analytics"
            ]
        },
        "xtetic": {
            "title": "Desarrollo de un Sistema de Verificación de Licencias Médicas",            
            "description": "Creación de un sistema automatizado para la validación de licencias de profesionales médicos para la empresa Xtetic. El proyecto utilizó web scraping para agilizar y verificar la información de múltiples fuentes, optimizando un proceso crítico.",
            "start": "diciembre del 2024",
            "end": "febrero del 2025"
        },
        "inglesenminutos": {
            "title": "Desarrollo de una Aplicación Web de Aprendizaje mediante IA",
            "description": "Participación en la creación de una plataforma educativa para aprender el inglés, integrando modelos AI de Google y AssemblyAI para reconocimiento de voz.",
            "start": "enero del 2024",
            "end": "septiembre del 2024"
        },
        "integragym": {
            "title": "Desarrollo de Sistema de Gestión Interno para Gimnasio",
            "description": "Desarrollo full-stack de un sistema interno para la gestión de un gimnasio. Me centré en la implementación de módulos de pagos, membresías y planes, así como en el registro y control de miembros.",
            "start": "enero del 2023",
            "end": "septiembre del 2023"
        },
        "artofgalaxy": {
            "title": "Implementación de Aplicación Web con Diseño Moderno",
            "description": "Participé en la creación de una aplicación web, enfocada en una experiencia de usuario (UX) atractiva y un diseño moderno. Se implementaron múltiples animaciones y efectos para una interfaz de usuario (UI) llamativa y dinámica.",
            "start": "febrero del 2025",
            "end": "marzo del 2025"
        }
        
    }
}