{
    "home": "Inicio",
    "about": "Sobre mi",
    "project": "Proyectos",
    "resume": "Curriculum",
    "im": "Soy",
    "description": "Con más de 3 años de experiencia, construyo aplicaciones web interactivas utilizando una variedad de lenguajes y frameworks como React, Next.js y Express.js.",
    "contact me": "Contáctame",
    "experience": "Experiencia",
    "proyects": {
        "title": {
            "first": "Mis Proyectos",
            "second": "Recientes"
        },
        "description": "Aquí hay algunos proyectos en los que he trabajado recientemente.",
        "surasalud": {
            "title": "Polizas de salud",
            "description": "Optimización de páginas de alta convertibilidad para una campaña de Google Ads dirigida a la venta de seguros de la marca Sura."
        },
        "suraautos": {
            "title": "Polizas de autos",
            "description": "Optimización de páginas de alta convertibilidad para una campaña de Google Ads dirigida a la venta de seguros de la marca Sura."
        },
        "artofgalaxy": {
            "title": "Art of galaxy",
            "description": "Aplicación React con diseño moderno. Para empresa de marketing."
        },
        "inglesenminutos": {
            "title": "Ingles en minutos",
            "description": "Plataforma educativa para aprender el inglés, integrando modelos AI de Google y AssemblyAI para reconocimiento de voz."
        },
        "integragym": {
            "title": "Integra gym",
            "description": "Sistema de gestión interna para gimnasio. Me centré en la implementación de módulos de pagos, membresías y planes, así como en el registro y control de miembros."
        },
        "latrikmedical": {
            "title": "Latrik medical",
            "description": "Sistema de gestión interna para una clinica. El front-end desarrollado en react."
        }
    },
    "works": {
        "duties": "Mis cargos",
        "landing": {
            "title": "Desarrollo de Landing Pages para Campaña de Marketing Digital",
            "description": "Creación y optimización de landing pages de alta conversión para una campaña en Google Ads, dirigida a la venta de seguros de la marca Sura.",
            "start": "abril del 2025",
            "end": "junio del 2025",
            "duties": [
                "Diseño de interfaces de usuario",
                "Optimización de conversión",
                "Desarrollo del front-end y back-end usando React y Next.js",
                "Integración de Google Ads y Google Analytics"
            ]
        },
        "xtetic": {
            "title": "Desarrollo de un Sistema de Verificación de Licencias Médicas",            
            "description": "Creación de un sistema automatizado para la validación de licencias de profesionales médicos para la empresa Xtetic. El proyecto utilizó web scraping para agilizar y verificar la información de múltiples fuentes, optimizando un proceso crítico.",
            "start": "diciembre del 2024",
            "end": "febrero del 2025",
            "duties": [
                "Fue responsable de la análisis y diseño de un scraper web para la validación de licencias médicas, definiendo la lógica y arquitectura para la extracción de datos.",
                "Desarrollé un programa en Node.js para implementar el scraper y crear una API separada.",
                "Manejé la integración con los APIs JotForm y Pipedrive, consumiendo datos para enriquecer la información y automatizar el flujo de trabajo.",
                "Fue responsable de la completa implementación del servicio en AWS, configurando el entorno para garantizar la disponibilidad y la correcta operación del servicio."
            ]
        },
        "inglesenminutos": {
            "title": "Desarrollo de una Aplicación Web de Aprendizaje mediante IA",
            "description": "Participación en la creación de una plataforma educativa para aprender el inglés, integrando modelos AI de Google y AssemblyAI para reconocimiento de voz.",
            "start": "enero del 2024",
            "end": "septiembre del 2024",
            "duties": [
                "Integración con la API de assemblyAI y speech.",
                "Interfaz y logica de grabación de audio.",
                "Logica para reconocimiento de palabras incorrectas.",
                "Sistema de pago y membresías.",
                "Sistema de registro de usuarios."
            ]
        },
        "integragym": {
            "title": "Desarrollo de Sistema de Gestión Interno para Gimnasio",
            "description": "Desarrollo full-stack de un sistema interno para la gestión de un gimnasio. Me centré en la implementación de módulos de pagos, membresías y planes, así como en el registro y control de miembros.",
            "start": "enero del 2023",
            "end": "septiembre del 2023",
            "duties": [
                "Implementé y configuré un sistema de pagos seguro para el gimnasio, gestionando el procesamiento de transacciones y el historial financiero de los miembros.",
                "Desarrollé una interfaz completa para la gestión de membresías, permitiendo la creación, edición y seguimiento del estado de cada usuario.",
                "Creé la lógica y la interfaz de usuario para el registro de entrada y salida de los miembros, controlando el acceso y la asistencia al gimnasio."
            ]
        },
        "artofgalaxy": {
            "title": "Implementación de Aplicación Web con Diseño Moderno",
            "description": "Participé en la creación de una aplicación web, enfocada en una experiencia de usuario (UX) atractiva y un diseño moderno. Se implementaron múltiples animaciones y efectos para una interfaz de usuario (UI) llamativa y dinámica.",
            "start": "febrero del 2025",
            "end": "marzo del 2025",
            "duties": [
                "Implementacion de animaciones y efectos",
                "Implementacion de un disdeño bento grid",
                "Implementacion de slideshows interactivos",
                "Correcion de errores de diseño"
            ]
        }
        
    },
    "skills": 
    {
        "title": "Habilidades <1>Técnicas</1>",
        "description": {
            "p1" : "Soy un desarrollador de software con experiencia <1>multifacética</1>, especializado en el <3>ecosistema de JavaScript</3>. He trabajado con una amplia variedad de tecnologías tanto en el <5>frontend como en el backend</5>. En el lado del cliente, domino frameworks como <7>React</7> y <9>Angular</9>, creando interfaces de usuario dinámicas y responsivas. Para el lado del servidor, he utilizado <11>Next.js</11> y <13>Express.js</13>, desarrollando aplicaciones robustas y escalables.",
            "p2" : "Además de mi experiencia en JavaScript, he trabajado con <1>PHP</1>, centrándome en el desarrollo de <3>plugins y temas personalizados para WordPress</3>. Mis habilidades también se extienden al desarrollo móvil, donde he construido aplicaciones nativas y multiplataforma usando <7>React Native</7> y <9>Flutter</9>. Complemento estas habilidades con experiencia en <11>web scraping</11> utilizando herramientas como <13>Playwright</13>, extrayendo datos de manera eficiente para proyectos específicos."
        },
        "tools": "<0>Herramientas</0> que utilizo"
    },
    "contact": {
        "title": "ENCUENTRAME EN",
        "description": "Siéntase libre de <1>conectarse</1> conmigo",
        "form":{
            "title": "HABLEMOS",
            "description": "¿Tienes alguna pregunta? ¿Necesitas una cotización personalizada? ¿Quieres planificar una consulta? Utiliza el formulario de abajo o conectate conmigo directamente y te responderé lo antes posible.",
            "name": "Nombre",
            "email": "Correo electrónico",
            "message": "Mensaje",
            "submit": "Enviar"
        }
    }
}